app/controllers/user_step_logs_controller.rb

	def index
		@user_step_logs = UserStepLog.all
---
SELECT `user_step_logs`.* FROM `user_step_logs`

	def create
		@user_step_log = UserStepLog.new(user_step_log_params)
		@user_step_log.save
---
INSERT INTO `user_step_logs` (`user_id`, `steps`, `favorite`, `created_at`, `updated_at`) VALUES (NULL, 11111, 2222, '2022-09-24 15:42:01.741491', '2022-09-24 15:42:01.741491')

	def edit
		@user_step_log = UserStepLog.find(params[:id])
---
SELECT `user_step_logs`.* FROM `user_step_logs` WHERE `user_step_logs`.`id` = 1 LIMIT 1

	def update
		@user_step_log = UserStepLog.find(params[:id])
		if @user_step_log.update(user_step_log_params)
---
SELECT `user_step_logs`.* FROM `user_step_logs` WHERE `user_step_logs`.`id` = 1 LIMIT 1
UPDATE `user_step_logs` SET `user_step_logs`.`steps` = 111114444, `user_step_logs`.`updated_at` = '2022-09-24 16:04:40.310133' WHERE `user_step_logs`.`id` = 1

	def show
		@user_step_log = UserStepLog.find(params[:id])
---
SELECT `user_step_logs`.* FROM `user_step_logs` WHERE `user_step_logs`.`id` = 1 LIMIT 1

	def destroy
		@user_step_log = UserStepLog.find(params[:id])
		@user_step_log.destroy
---
SELECT `user_step_logs`.* FROM `user_step_logs` WHERE `user_step_logs`.`id` = 1 LIMIT 1
DELETE FROM `user_step_logs` WHERE `user_step_logs`.`id` = 1